cases/FPCM16__4plus8cells_lcmFoam23mules_dynamic/constant/porosityProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      porosityProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

porosity1  //FP
{
    type            DarcyForchheimer;
    active          yes;
    cellZone        porosityFP;
    porosity        0.5;

    DarcyForchheimerCoeffs
    {
        d   (6.67e10 6.67e10 2e12);  
        f   (0 0 0);

        coordinateSystem
        {
            type    cartesian;
            origin  (0 0 0);
            rotation
            {
                type    axes;
                e1      (1 0 0);
                e2      (0 1 0);
            }
        }
    }
}


porosity2  //DM
{
    type            DarcyForchheimer;
    active          yes;
    cellZone        porosityDM;
    porosity        0.9;

    DarcyForchheimerCoeffs
    {
        d   (1e9 1e9 1e9);  
        f   (0 0 0);

        coordinateSystem
        {
            type    cartesian;
            origin  (0 0 0);
            rotation
            {
                type    axes;
                e1      (1 0 0);
                e2      (0 1 0);
            }
        }
    }
}


// ************************************************************************* //
