cases/FPCM16__4plus8cells_lcmFoam23mules_dynamic/0/alpha1_
/*----------------*- C++ -*-----------------*
| F ield | OpenFOAM: The Open Source CFD Toolbox |
| O peration | Version: 2.1.1 |
| A nd | Web: www.OpenFOAM.org |
| M anipulation | |
--------------------------------*/
    FoamFile
    {
        version 2.0;
        format ascii;
        class volScalarField;
        object alpha1_;
    }
    // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
    dimensions [0 0 0 0 0 0 0];
    internalField uniform 0;  //1;  //
    boundaryField
    { 
        slip
        {
            type zeroGradient;
        }
        dynamic
        {
            type zeroGradient;
        }

        outlet
        {
            type advective;
            //type inletOutlet;
            //inletValue 0;
        }
    
        inlet
        {
            type fixedValue;
            value uniform 1;
        }
    }
    // ************************************************************************* //

